<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<title itemprop="name">Поверхностный отрисовщик</title>
<meta property="og:title" content="Поверхностный отрисовщик">
<meta property="og:description" content="Неглубокая отрисовка позволяет отрисовать компонент
«на один уровень глубины» и утверждать то, что возвращает его метод отрисовки, не беспокоясь
о поведении дочерних компонентов, которые не создаются или не отображаются. Это не требует DOM.">
<meta name="description" content="Неглубокая отрисовка позволяет отрисовать компонент
«на один уровень глубины» и утверждать то, что возвращает его метод отрисовки, не беспокоясь
о поведении дочерних компонентов, которые не создаются или не отображаются. Это не требует DOM.">
<meta property="og:url" content="https://learn-reactjs.ru/reference/shallow-renderer">
<meta name="keywords" CONTENT="Справочное руководство, Поверхностный отрисовщик">