<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<title itemprop="name">5.8 Состояние приложения</title>
<meta property="og:title" content="5.8 Состояние приложения">
<meta property="og:description" content="В этот разделе речь пойдёт о таком таком крайне важном в настоящее время
        элементе приложения как состояние.  React даёт нам возможность работать с
        состоянием компонента. Дочерний компонент может узнать об изменении состояния
        родителя через props. Но как быть, когда компоненты не имеют общего предка?
        Приложение постоянно получает и посылает данные на сервер, как об этом может
        знать множество компонентов? Можно ли хранить данные приложения в каком-нибудь
        централизованном хранилище, чтобы к нему имели доступ желаемые компоненты? Эти и
        масса похожих вопросов небезосновательны. Они требуют серьёзного рассмотрения,
        так как неизбежно возникают по мере роста приложения.">
<meta name="description" content="В этот разделе речь пойдёт о таком таком крайне важном в настоящее время
        элементе приложения как состояние.  React даёт нам возможность работать с
        состоянием компонента. Дочерний компонент может узнать об изменении состояния
        родителя через props. Но как быть, когда компоненты не имеют общего предка?
        Приложение постоянно получает и посылает данные на сервер, как об этом может
        знать множество компонентов? Можно ли хранить данные приложения в каком-нибудь
        централизованном хранилище, чтобы к нему имели доступ желаемые компоненты? Эти и
        масса похожих вопросов небезосновательны. Они требуют серьёзного рассмотрения,
        так как неизбежно возникают по мере роста приложения.">
<meta property="og:url" content="https://learn-reactjs.ru/training-project/app-state">
<meta name="keywords" CONTENT="React, Хуки, Состояние приложения">