<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<title itemprop="name">5.7 Асинхронная загрузка данных</title>
<meta property="og:title" content="5.7 Асинхронная загрузка данных">
<meta property="og:description" content="Большинство веб-приложений работают с данными, которые, как правило, хранятся
        в базе данных (БД). Что получить эти данные приложения обычно используют AJAX,
        то есть асинхронные запросы к серверу. Сервер, получив такой запрос, обращается
        к БД, а затем возвращает данные обратно приложению. Здесь мы подробнее рассмотрим
        суть асинхронной загрузки данных и её возможную реализацию.">
<meta name="description" content="Большинство веб-приложений работают с данными, которые, как правило, хранятся
        в базе данных (БД). Что получить эти данные приложения обычно используют AJAX,
        то есть асинхронные запросы к серверу. Сервер, получив такой запрос, обращается
        к БД, а затем возвращает данные обратно приложению. Здесь мы подробнее рассмотрим
        суть асинхронной загрузки данных и её возможную реализацию.">
<meta property="og:url" content="https://learn-reactjs.ru/training-project/async-data-loading">
<meta name="keywords" CONTENT="React, Учебный проект, Асинхронная загрузка данных">