<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<title itemprop="name">Создать новое React приложение</title>
<meta property="og:title" content="Создать новое React приложение">
<meta property="og:description" content="В данном разделе описаны несколько популярных наборов
		инструментов React, которые помогают в таких задачах, как: масштабирование множества файлов и компонентов,
		использование сторонних библиотек из npm, раннее обнаружение распространенных ошибок, отслеживаемое редактирование
		CSS и JS в режиме разработки, оптимизация кода для релиза.">
<meta name="description" content="В данном разделе описаны несколько популярных наборов
		инструментов React, которые помогают в таких задачах, как: масштабирование множества файлов и компонентов,
		использование сторонних библиотек из npm, раннее обнаружение распространенных ошибок, отслеживаемое редактирование
		CSS и JS в режиме разработки, оптимизация кода для релиза.">
<meta property="og:url" content="https://learn-reactjs.ru/introduction/create-a-new-react-app">
<meta name="keywords" CONTENT="Создать новое React приложение, Введение в ReactJS, Введение">