<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<title itemprop="name">5.6 Маршрутизация</title>
<meta property="og:title" content="5.6 Маршрутизация">
<meta property="og:description" content="Здесь мы поговорим о такой важной составляющей любого серьезного веб-приложения,
        как маршрутизация. Пользователь должен видеть где он находится в данный момент времени
        в приложении, а также иметь возможность навигации по истории. Сам по себе React маршрутизацию
        не поддерживает, зато есть мощные библиотеки с целым арсеналом возможностей. Как раз одну
        из таких библиотек мы интегрируем в наш проект.">
<meta name="description" content="Здесь мы поговорим о такой важной составляющей любого серьезного веб-приложения,
        как маршрутизация. Пользователь должен видеть где он находится в данный момент времени
        в приложении, а также иметь возможность навигации по истории. Сам по себе React маршрутизацию
        не поддерживает, зато есть мощные библиотеки с целым арсеналом возможностей. Как раз одну
        из таких библиотек мы интегрируем в наш проект.">
<meta property="og:url" content="https://learn-reactjs.ru/training-project/routing">
<meta name="keywords" CONTENT="React, Учебный проект, Маршрутизация">