<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<title itemprop="name">Разбиение кода</title>
<meta property="og:title" content="Разбиение кода">
<meta property="og:description" content="Разбиение кода вашего приложения может помочь вам «лениво подгружать» только то,
		что в данный момент требуется пользователю, что может значительно повысить производительность
		вашего приложения. Хотя вы не сократили общий объем кода в своем приложении, вы избежали
		загрузки кода, который может никогда не потребоваться пользователю, а также сократили объем кода,
		необходимый для первоначальной загрузки.">
<meta name="description" content="Разбиение кода вашего приложения может помочь вам «лениво подгружать» только то,
		что в данный момент требуется пользователю, что может значительно повысить производительность
		вашего приложения. Хотя вы не сократили общий объем кода в своем приложении, вы избежали
		загрузки кода, который может никогда не потребоваться пользователю, а также сократили объем кода,
		необходимый для первоначальной загрузки.">
<meta property="og:url" content="https://learn-reactjs.ru/core/context">
<meta name="keywords" CONTENT="Ядро React, Контекст, Контекст в ReactJS">