<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%@taglib prefix="lt" tagdir="/WEB-INF/tags/layout" %>
<%@taglib prefix="wg" tagdir="/WEB-INF/tags/widget" %>

<c:url var="termsOfUseImgUrl" value="/resources/imges/pages/termsOfUse/contract.png"/>

<lt:layout>
	<lt:layout><h2 class="text-center"><b>Пользовательское соглашение</b></h2></lt:layout>

	<br/>

	<lt:layout><h4><b>1. Общие условия</b></h4></lt:layout>

	<wg:p>1.1. Использование материалов и сервисов Сайта регулируется нормами действующего
		законодательства Республики Беларусь.</wg:p>

	<wg:p>1.2. Настоящее Соглашение является публичной офертой. Получая доступ к
		Сайту и используя Сервисы Пользователь считается присоединившимся к настоящему Соглашению.</wg:p>

	<wg:p>1.3. Пользователь может ознакомиться с действующей версией Соглашения в сети
		Интернет по адресу <wg:link href="https://learn.react-js.ru/terms-of-use">https://learn.react-js.ru/terms-of-use</wg:link>.
		Администрация Сайта вправе в любое время в одностороннем порядке изменять
		условия настоящего Соглашения. Такие изменения вступают в силу вступает в силу с
		момента опубликования на Сайте. При несогласии Пользователя с
		внесенными изменениями он обязан отказаться от доступа к Сайту, прекратить использование
		материалов и сервисов Сайта.</wg:p>

	<br/>
	<lt:layout><h4><b>2. Обязательства Пользователя</b></h4></lt:layout>

	<wg:p>2.1. Пользователь соглашается не предпринимать действий, которые могут
		рассматриваться как нарушающие белорусское законодательство или нормы международного
		права, в том числе в сфере интеллектуальной собственности, авторских и/или смежных правах,
		а также любых действий, которые приводят или могут привести к нарушению нормальной
		работы Сайта и сервисов Сайта.</wg:p>

	<wg:p>Использование (в том числе в коммерческих целях), копирование, продажа материалов Сайта: текста, примеров кода, изображений и других объектов без
		согласия правообладателей не допускается (статья 983 Гражданского Кодекса Республики Беларусь).
		Для правомерного использования материалов Сайта необходимо заключение лицензионных
		договоров (получение лицензий) от Правообладателей (статья 985 Гражданского Кодекса Республики Беларусь).</wg:p>

	<wg:p>2.3. При цитировании материалов Сайта, включая охраняемые авторские произведения,
		ссылка на Сайт обязательна (пункт 1 статьи 34 Закона Республики Беларусь Об авторском праве и смежных правах).</wg:p>

	<wg:p>2.4. Комментарии и иные записи Пользователя на Сайте не должны вступать в противоречие с
		требованиями законодательства Республики Беларусь и общепринятых норм морали и нравственности.</wg:p>

	<wg:p>2.5. Пользователь предупрежден о том, что Администрация Сайта не несет ответственности за
		посещение и использование им внешних ресурсов, ссылки на которые могут содержаться на сайте.</wg:p>

	<wg:p>2.6. Пользователь согласен с тем, что Администрация Сайта не несет ответственности и не
		имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными
		или возникшими потерями или убытками, связанными с любым содержанием Сайта, регистрацией
		авторских прав и сведениями о такой регистрации, товарами или услугами, доступными на
		или полученными через внешние сайты или ресурсы либо иные контакты Пользователя, в
		которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.</wg:p>

	<wg:p>2.7. Пользователь принимает положение о том, что все материалы и сервисы Сайта
		или любая их часть могут сопровождаться рекламой. Пользователь согласен с тем, что
		Администрация Сайта не несет какой-либо ответственности и не имеет каких-либо
		обязательств в связи с такой рекламой.</wg:p>

	<br/>
	<lt:layout><h4><b>3. Отказ администрации от ответственности</b></h4></lt:layout>

	<wg:p>3.1 Администрация сайта имеет право остановить на время или окончательно прекратить работу Сайта,
		Сервисов или любых компонентов Сайта на период модернизации, обновления, обслуживания
		или по иной причине.</wg:p>

	<wg:p>3.2 Администрация сайта имеет право изменить внешний вид любых компонентов, функциональность и другие компоненты Сайта без
		предварительного уведомления пользователей.</wg:p>

	<wg:p>3.3 Администрация сайта не несет никакой ответственности за произвольные убытки, которые могут случиться в результате
		использования Сайта, Сервисов и информации с Сайта Пользователем.</wg:p>

	<wg:p>3.4 Ответственность Администрации сайта ограничена только получением от Пользователя оплаты.
		Ответственность на Администрацию сайта возлагается только при наличии в её действиях каких-либо
		противоправных, противозаконных действий в отношении пользователя.</wg:p>

	<br/>
	<lt:layout><h4><b>4. Прочие условия</b></h4></lt:layout>

	<wg:p>4.1. Все возможные споры, вытекающие из настоящего Соглашения или связанные с ним,
		подлежат разрешению в соответствии с действующим законодательством Республики Беларусь.</wg:p>

	<wg:p>4.2. Ничто в Соглашении не может пониматься как установление между Пользователем
		и Администрации Сайта агентских отношений, отношений товарищества, отношений по
		совместной деятельности, отношений личного найма, либо каких-то иных отношений,
		прямо не предусмотренных Соглашением.</wg:p>

	<wg:p>4.3. Признание судом какого-либо положения Соглашения недействительным или не
		подлежащим принудительному исполнению не влечет недействительности иных положений Соглашения.</wg:p>

	<wg:p>4.4. Бездействие со стороны Администрации Сайта в случае нарушения кем-либо
		из Пользователей положений Соглашения не лишает Администрацию Сайта права предпринять
		позднее соответствующие действия в защиту своих интересов и защиту авторских прав на
		охраняемые в соответствии с законодательством материалы Сайта.</wg:p>

	<br/>
	<wg:p><b>Пользователь подтверждает, что ознакомлен со всеми пунктами настоящего Соглашения
		и безусловно принимает их.</b></wg:p>

	<wg:p cssClass="terms-of-use-icon">
		<wg:img cssClass="terms-of-use-icon__img" src="${termsOfUseImgUrl}"/>
	</wg:p>
</lt:layout>