<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<title itemprop="name">Информация по асинхронной отрисовке компонентов</title>
<meta property="og:title" content="Информация по асинхронной отрисовке компонентов">
<meta property="og:description" content="Уже более года команда React работает над реализацией асинхронной отрисовки.
        Теперь мы хотели бы поделиться с вами некоторыми уроками, которые усвоили, работая над этими функциями,
        а также некоторыми рекомендациями, которые помогут подготовить ваши компоненты для асинхронной
        отрисовки, когда она будет активирована.">
<meta name="description" content="Уже более года команда React работает над реализацией асинхронной отрисовки.
        Теперь мы хотели бы поделиться с вами некоторыми уроками, которые усвоили, работая над этими функциями,
        а также некоторыми рекомендациями, которые помогут подготовить ваши компоненты для асинхронной
        отрисовки, когда она будет активирована.">
<meta property="og:url" content="https://learn-reactjs.ru/updates/async-rendering-update">
<meta name="keywords" CONTENT="Обновления, Асинхронная отрисовка, Асинхронный рендеринг, Информация по асинхронной отрисовке компонентов">